///week11-3.cpp step02-2 泡泡排序法
#include <stdio.h>
///int a[10]={4,5,6,1,2,3,7,8,9,0};///(1)陣列
///int a[10]={0,3,2,1,4,5,6,7,8,9};///快排好的
int a[10]={9,8,7,6,5,4,3,2,1,0};///最差的狀況
int main()
{
    for(int i=0;i<10;i++) printf("%d",a[i]);
    printf("\n");///把現在的陣列印出來觀察

    for(int k=0;k<9;k++){///一直做
    ///原則: 左右比對，順序不對時，交換
    for(int i=0;i<10-1;i++){///迴圈怎麼跑
    if (a[i]>a[i+1]){///(2)反過來想左大，右小，就交換
     int t=a[i];///(3)交換
         a[i]=a[i+1];
         a[i+1]=t;
        }
    }
    for(int i=0;i<10;i++) printf("%d ",a[i]);
    printf("\n");///把現在的陣列印出來觀察
}







}
